#ifndef __LCD_12864_H__
#define __LCD_12864_H__
#include"define.h"
 
/************************** 12864液晶屏驱动************************************/

/********************************定义接口**************************************/

#define LCD_12864_DATA P0		//并行数据口
sbit LCD_12864_BUSY=P0^7; 		//忙碌标志位
sbit LCD_12864_RS = P3^5;			//并行指令/数据选择信号，串行片选信号
sbit LCD_12864_RW	= P3^6;			//读/写控制信号，串行数据口
sbit LCD_12864_EN = P3^4;			//并行使能信号，串行同步时钟
sbit LCD_12864_PSB = P3^7;		//并/串行（H/L）接口选择

/********************************驱动函数**************************************/

void LCD_12864_init(void);	//12864液晶初始化

/**************** x=(1--2) y(1--40) seg为字符串首地址 */
void LCD_12864_display_string(uchar x,uchar y,uchar *seg);  
 	
#endif